'number' + 3 + 3
// Результат: number33
// Через неявне приведення типів 3 буде рахуватись як рядок, а не як число
// Тому спочатку буде number3, далі 'number33'


null + 3
// Результат: 3
// Через неявне приведення типів null буде рахуватись як 0, а не як ключове слово
// Тому читатись інтерпретатором воно буде 0+3 -> 3


5 && "qwerty"
// Результат: "qwerty"
// 5 тут є truthy значенням, тому && переходить до наступного значення
// Після переходу до наступного значення оператор буде повертати truthy значення - querty
// Truthy це як правдоподыбне значення, тому для оператора воно рахуэться як true


+'40' + +'2' + "hillel";
// Результат: 42hillel
// Плюс перед рядком приводить string до number, тому +'40' та +'2' будуть рахуватись як number
// Далі числа 40 та 2 сплюсуються -> буде 42
// А через приведення типів 42 знову буде рахуватись як string та зконкатенується з "hillel"
// Після чого буде рядок "42hillel"


'10' - 5 === 6;
// Результат: false
// Через неявне приведення типів 10 буде рахуватись як number -> 5 після операції віднімання. Її рахуємо у першу чергу, адже арифметичні операції приіорітетніші аніж бульові
// 5 не дорівнює 6 -> тому false


true + false
// Результат: 1
// true рахується як 1, false рахується як 0


'4px' - 3
// Результат: NaN
// 4px буде намагатись, але ніяк не зконвертується до number
// А після операції string - number буде NaN (Not a Number) -> тобто не число


'4' - 3
// Результат: 1
// '4' зконвертується в 4
// Після чого буде 4 - 3 -> 1


'6' + 3 ** 0;
// Результат: '61'
// 3 ** 0 -> 1, оскільки будь яке число у степені 0 це 1
// Далі 1 приведеться до string -> тому '61'


12 / '6'
// Результат: 2
// '6' конвертуэться у 6
// Після чого буде 12 / 6 -> 2


'10' + (5 === 6);
// Результат: '10false'
// 5 === 6 -> false, також буде рахуватись у першу чергу через дужки
// false приведеться до string -> тому '10false'


null == ''
// Результат: false
// null дорівнює тільки undefined у не строгому порівнянні ==
// А '' не дорівнює null у цьому випадку -> тому false


3 ** (9 / 3);
// Результат: 27
// Операція в дужка рахується у першу чергу -> 9/3 = 3
// 3 ** -> 27


!!'false' == !!'true'
// Результат: true
// 'false' та 'true' це truthy значення 
// Оператор ! інвертує boolean значення -> truthy до true, а з ! => false
// Далі ще один ! інвертує false до true
// І потім вони порівнюються -> true == true


0 || '0' && 1
// Результат: 1
// '0' && 1 - порівняння truthy та true значення -> true
// || буде повертати true при хоч одному true


(+null == false) < 1;
// Результат: false
// Операцыю в дужках виконуэмо першою
// +null буде повертати 0, 0 це falthy значення -> тому порівняння у дужках поверне true
// true рівнозначне 1 тому порівняння поверне false, адже 1 не може бути менше 1


false && true || true
// Результат: true
// false && true - повертає false якщо хоч один єлемент порівняння false
// false || true - повертає true якщо хоч один єлемент порівняння true


false && (false || true);
// Результат: false
// Операція у дужках виконується у першу чергу
// false || true - повертає true якщо хоч один єлемент порівняння true
// false && true - повертає false якщо хоч один єлемент порівняння false


(+null == false) < 1 ** 5
// Результат: false
// Операція у дужках виконується у першу чергу
// +null буде повертати 0, 0 це falthy значення -> тому порівняння у дужках поверне true
// Арифметична операція буде виконуватись далі, оскільки у неї приорітет вищій аніж у операції порівняння
// 1 ** 5 -> 1
// true < 1 - false, оскільки 1 не може бути менше аніж 1